In [1]:
import pandas as pd
import numpy as np

In [2]:
df=np.arange(0,20).reshape(5,4)

In [3]:
df

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [4]:
df1=pd.DataFrame(df,index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4'])

In [5]:
df1

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [6]:
df1.iloc[:2,:2]

    C1  C2
R1   0   1
R2   4   5

In [7]:
df1.loc['R1']

C1    0
C2    1
C3    2
C4    3
Name: R1, dtype: int32

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, R1 to R5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      5 non-null      int32
 1   C2      5 non-null      int32
 2   C3      5 non-null      int32
 3   C4      5 non-null      int32
dtypes: int32(4)
memory usage: 280.0+ bytes

In [9]:
df1.describe()

              C1         C2         C3         C4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [10]:
df1['C1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: C1, dtype: int64

In [11]:
#while reading a csv if it is not comma sep use second argument (if ; separated 2nd arg = sep';')

In [12]:
from io import StringIO,BytesIO

In [13]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
     '5,6,7,8\n'
     '9,10,11,12')

In [14]:
df2=pd.read_csv(StringIO(data))

In [15]:
df2

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [16]:
pd.read_csv(StringIO(data),usecols=['a','b'])

   a   b
0  1   2
1  5   6
2  9  10

In [17]:
pd.read_csv(StringIO(data),dtype=object)

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [18]:
df2['a']

0    1
1    5
2    9
Name: a, dtype: int64

In [19]:
kf=pd.read_csv(StringIO(data),dtype={'b':'int64','c':float})

In [20]:
kf

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [21]:
df2['a'][2]

9

In [22]:
kf.dtypes

a      int64
b      int64
c    float64
d      int64
dtype: object

In [23]:
data2=('a,b,c\n'
     '1,2,3,4\n'
     '2,6,7,8\n'
     '3,10,11,12')

In [24]:
pd.read_csv(StringIO(data2))

    a   b   c
1   2   3   4
2   6   7   8
3  10  11  12

In [25]:
pd.read_csv(StringIO(data2),index_col=False)

   a   b   c
0  1   2   3
1  2   6   7
2  3  10  11

In [27]:
pd.read_csv(StringIO(data2),usecols=['b','c'],index_col=False)

    b   c
0   2   3
1   6   7
2  10  11

In [28]:
data3='a,b\n"hello, \\"Bob\\",nice to meet you",5'

In [31]:
pd.read_csv(StringIO(data3),escapechar='\\')

                               a  b
0  hello, "Bob",nice to meet you  5

In [32]:
#if data is in site 'url' can be used intsead of StringIO(data)

In [33]:
df1

    C1  C2  C3  C4
R1   0   1   2   3
R2   4   5   6   7
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19

In [37]:
df1[df1['C2']>5]

    C1  C2  C3  C4
R3   8   9  10  11
R4  12  13  14  15
R5  16  17  18  19